In [71]:
import numpy as np
import pandas as pd

let's create two data frame
the first one has a missing value

In [78]:
df1 = pd.DataFrame({"a" : [6,3,9,8], "b" : [2,5,np.nan,4]}, index = [1,2,3,4])
df2 = pd.DataFrame({"a" : [21,55,32,8], "b" : [34,53,66,4]}, index = [1,2,3,4])
display(df1)
display(df2)

   a    b
1  6  2.0
2  3  5.0
3  9  NaN
4  8  4.0

    a   b
1  21  34
2  55  53
3  32  66
4   8   4

here, as a simple method, we use the average value for the missing value
median() and mode() are also can be used

In [100]:
df1.fillna(df1['b'].mean(), inplace= True)
display(df1)

   a         b
1  6  2.000000
2  3  5.000000
3  9  3.666667
4  8  4.000000

now we combine two data frames

In [89]:
df3 = df1._append(df2, ignore_index=True)
display(df3)

    a     b
0   6   2.0
1   3   5.0
2   9   NaN
3   8   4.0
4  21  34.0
5  55  53.0
6  32  66.0
7   8   4.0

to find dunplicated values we can use this code:

In [92]:
display(df3.duplicated())

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
dtype: bool

to find the correlation value of the column a and b we use this code

In [96]:
correlation = df3.corr()
display(correlation)

          a         b
a  1.000000  0.866081
b  0.866081  1.000000